water_example/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0 0 0)
    (75 0 0)       // Full width
    (75 6 0)      // Full height
    (0 6 0)
    (0 0 0.1)      //  thin depth for 2D simulation
    (75 0 0.1)
    (75 6 0.1)
    (0 6 0.1)
);

blocks
(
    // Reduced cell count with grading for better resolution near impact
    hex (0 1 2 3 4 5 6 7) (1000 80 1) simpleGrading (2 1 1)
);

edges
(
    // no special edges
);

boundary
(
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    rightWall
    {
        type patch;  // Changed to patch for better wave transmission
        faces
        (
            (1 2 6 5)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }

    leftWall
    {
        type wall;
        faces
        (
            (3 0 4 7)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
