water_example/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.01;  // Keep this relatively small for good wave frequency analysis

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.8;

maxAlphaCo      0.8;

maxDeltaT       0.01;

functions
{
    waveMeasurement
    {
        type            sets;
        libs            (sampling);
        writeControl    writeTime;
        writeInterval   1;

        interpolationScheme cellPoint;
        setFormat       raw;
        
        sets
        {
            probe1 { type uniform; axis y; start (15 0 0.05); end (15 6 0.05); nPoints 60; }
            probe2 { type uniform; axis y; start (25 0 0.05); end (25 6 0.05); nPoints 60; }
            probe3 { type uniform; axis y; start (35 0 0.05); end (35 6 0.05); nPoints 60; }
        }

        fields          (alpha.water);
    }

    interfaceHeight1
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeInterval   1;
        
        writeFields     true;
        fields          (alpha.water);
        operation       areaAverage;
        
        regionType      patch;
        name            atmosphere;
        
        surfaceFormat   raw;
    }

    interfaceHeight2
    {
        $interfaceHeight1;
        name            atmosphere;
    }

    interfaceHeight3
    {
        $interfaceHeight1;
        name            atmosphere;
    }
}

// ************************************************************************* //
