water_example/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    // Water pool with flat surface
    boxToCell
    {
        box (0 0 0) (75 3 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    // Single droplet with initial velocity
    sphereToCell
    {
        centre  (37.5 5 0.05);
        radius  1.0;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U (0 -2 0)
        );
    }
);

// ************************************************************************* //
